// Credentials from Password Stores: Windows Credential Manager
// https://attack.mitre.org/techniques/T1555/004/
DeviceProcessEvents
| where (ProcessCommandLine contains "vaultcmd" and ProcessCommandLine contains "/listcreds") or
        (ProcessCommandLine contains "cmdkey" and ProcessCommandLine contains "/list")
| extend EasternTime = datetime_utc_to_local(TimeGenerated, "US/Eastern")
| project EasternTime,
          DeviceName,
          AccountName,
          AccountDomain,
          AccountUpn,
          ProcessCommandLine,
          InitiatingProcessCommandLine,
          InitiatingProcessAccountName
