//OS Credential Dumping: LSASS Memory
//https://attack.mitre.org/techniques/T1003/001/

//https://lolbas-project.github.io/lolbas/Binaries/Rdrleakdiag/

//https://lolbas-project.github.io/lolbas/Binaries/Rpcping/

//https://lolbas-project.github.io/lolbas/Binaries/Tttracer/

//https://lolbas-project.github.io/lolbas/OtherMSBinaries/Createdump/

//https://lolbas-project.github.io/lolbas/OtherMSBinaries/Dump64/

//https://lolbas-project.github.io/lolbas/OtherMSBinaries/DumpMinitool/

//https://lolbas-project.github.io/lolbas/OtherMSBinaries/Sqldumper/

DeviceProcessEvents
| extend EasternTime = datetime_utc_to_local(TimeGenerated, "US/Eastern")
| where FileName has_any (
        "rundll32.exe",
        "procdump.exe",
        "rdrleakdiag.exe",
        "RpcPing.exe",
        "tttracer.exe",
        "createdump.exe",
        "dump64.exe",
        "DumpMinitool.exe"
        "sqldumper.exe"
        )
  and ProcessCommandLine has_any (
        "comsvcs.dll",
        "MiniDump",
        "/fullmemdmp",
        "NTLM",
        "-dumpFull",
        "-attach",
        "-n",
        "-f"
        "--file",
        "--processId",
        "--dumpType",
        "0x0110",
        "0x01100:40",
        "lsass.exe",
        "lsass"
        )
| where ProcessCommandLine !contains "Yealink" // tuning
| project EasternTime,DeviceName,
          InitiatingProcessAccountName,
          InitiatingProcessFolderPath,
          InitiatingProcessId,
          InitiatingProcessCommandLine,
          ProcessCommandLine,
          ProcessId
